sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/createAccount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.createAccount">
   <soapenv:Header/>
   <soapenv:Body>
     <sug:sugarcrmUrl>https://nyqcvr4839.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
     <sug:username>admin</sug:username>
     <sug:password>61BD60C60D9FB60CC8FC7767669D40A1</sug:password>
     <sug:name>kuna</sug:name>
     <sug:phone>012123232</sug:phone>
     <sug:website>www.yaho.com</sug:website>
   </soapenv:Body>
</soapenv:Envelope>